Repository: Konstantin-2/copyko
Catalog: */copyko.po
Languages: ru

source: is dependency for
ru: является зависимостью для

source: not found
ru: не найден

source: Can't copy %s to %s
ru: Ошибка копирования %s в %s

source: Can't create directory %s
ru: Ошибка создания каталога %s

source: Can't make hard link for file %s
ru: Ошибка создания жесткой ссылки на файл %s

source: Can't run %s
ru: Не могу запустить %s

source: Dependency tree is too deep
ru: Дерево зависимостей слишком большое

source: Destination directory is
ru: Целевой каталог

source: Destination firmware directory is
ru: Целевой каталог для прошивок

source: Module
ru: Модуль

source: Source directory is
ru: Каталог-источник

source: Source firmware directory is
ru: Каталог-источник с прошивками

source: There are more than one module with same name
ru: Найдено несколько модулей с одинаковым названием

source: Unrecognized option %s
ru: Нераспознанная опция %s

source: Usage: copyko [OPTION] <module> ... <dest> Copy kernel modules (ko-files) and its' dependencies to <dest> directory The program is useful when creating Live CD Options: -f, --from=FROM directory to search kernel modules --fwsrc=FROM directory to search firmware --fwdst=TO directory to store firmware -l, --link try to make hard links instead of copy files -v, --verbose explain what is being done --help display this help and exit --version output version information and exit Report bugs to: oks-mgn@mail.ru copyko home page: https://github.com/Konstantin-2/copyko.git General help using GNU software: <https://www.gnu.org/gethelp/>
ru: Использование: copyko [ОПЦИИ] <ko-файл> ... <целевой каталог> Копирует заданные модули ядра (<ko-файлы>) и их зависимости в <целевой каталог> Программа полезна при создании загрузочных CD-дисков Опции: -f, --from=откуда каталог, в котором искать модули ядра --fwsrc=откуда каталог, в котором искать прошивки --fwdst=куда каталог, в который копировать прошивки -l, --link пытаться делать жесткие ссылки вместо копирования -v, --verbose показывать дополнительную информацию --help показать эту справку и завершить работу --version показать версию программы и завершить работу Об ошибках сообщайте по адресу: oks-mgn@mail.ru copyko в Интернете: https://github.com/Konstantin-2/copyko.git General help using GNU software: <https://www.gnu.org/gethelp/>

source: You can omit dependency modules because they are autocopied by other modules.
ru: Вы можете не указывать явно эти файлы, они скорируются автоматически как зависимости.
